{
  "Healthy strawberry": [
    "The strawberry leaves are vibrant green, showing no visible spots or discoloration.",
    "A healthy strawberry plant displays firm, unblemished fruit with bright red color.",
    "Strawberry flowers are intact, with white petals and undamaged centers.",
    "There are no brown, wilted, or curled edges on healthy strawberry leaves.",
    "The strawberry fruit surface appears smooth and glossy, with no signs of mold or rot.",
    "Stems of a healthy strawberry plant are green and upright, without any lesions or cracks.",
    "The entire strawberry plant looks lush and evenly colored, free of any patches or dryness.",
    "New strawberry leaves unfurl cleanly, showing even green coloration throughout.",
    "Healthy strawberry fruit shows even ripening, lacking green or sunken areas."
  ],
  "Gray mold (Botrytis cinerea)": [
    "The strawberry fruit has fuzzy grayish mold covering soft, decaying areas.",
    "A strawberry displays water-soaked, pale brown spots that quickly expand into larger patches.",
    "Strawberry fruit is partly covered by dusty gray spores, often starting at wounds or the stem end.",
    "Strawberry leaves near the moldy fruit may look wilted or discolored.",
    "Soft, mushy tissue develops on the strawberry fruit, turning brown or dull gray.",
    "The strawberry surface shows irregular, sunken, and rapidly spreading areas of rot.",
    "A strawberry often collapses or loses its shape as mold consumes the tissue.",
    "Clusters of affected strawberry fruit appear matted together with grayish fungal growth.",
    "Around the stem of a strawberry, fine gray hairs (spores) may be visible in humid conditions.",
    "Strawberry fruits on damp soil are sometimes entirely encased in a gray, fuzzy covering.",
    "Rotten areas on a strawberry quickly develop a dusty appearance as the mold matures."
  ],
  "V-shaped brown leaf spot": [
    "Strawberry leaves show distinct V-shaped brown lesions starting at the edge and pointing towards the midrib.",
    "A strawberry plant displays sharply defined brown areas forming a V pattern on the leaf margin.",
    "Some strawberry leaves have tan to dark brown wedge-shaped patches near the edges.",
    "The center of the V-shaped spot on the strawberry leaf may appear darker or papery compared to the rest.",
    "Strawberry leaves affected show brown sections bordered by yellow or lighter green halos.",
    "There are multiple V-shaped spots scattered across the strawberry leaf surface.",
    "Some areas on the strawberry foliage exhibit a V-shaped drying or withering appearance.",
    "On a strawberry leaf, the pointed tip of the V usually faces inward, toward the main vein.",
    "Older strawberry leaves may show merging V-shaped lesions forming larger brown patches.",
    "Newer strawberry leaves display small V-shaped brown spots near the margins."
  ],
  "Fertilizer damage": [
    "Strawberry leaves show scorched, brown edges distinctly outlining the tips and sides.",
    "A strawberry plant has leaves with crisp, dry margins while the center remains green.",
    "Irregular, bleached patches are seen on the surface of strawberry leaves after fertilizer exposure.",
    "Some strawberry leaf tips appear burned, curling upwards and becoming brittle.",
    "Yellow halos can be observed bordering burned strawberry leaf areas.",
    "Stunted strawberry growth is evident alongside patchy, discolored leaves.",
    "Strawberry leaves display a mosaic of healthy green and sharply delineated brown or tan areas.",
    "Leaf veins on the strawberry often remain green while the area around them appears scorched.",
    "Lower strawberry leaves are most heavily affected, with symptoms worsening downward."
  ],
  "Blight": [
    "Strawberry leaves develop large, irregular brown areas spreading quickly across the surface.",
    "A strawberry plant exhibits sudden wilting with leaves turning a dull brown or black.",
    "Strawberry stems and petioles have dark, sunken streaks or lesions along their length.",
    "Leaves on the strawberry appear scorched, often collapsing inward from the edges.",
    "The whole strawberry plant can show rapid dieback, with multiple leaves turning brown simultaneously.",
    "Dried, shriveled leaves remain attached to the strawberry plant, giving a burned appearance.",
    "You may see concentric zones of brown and lighter tan in blighted strawberry tissue.",
    "Some strawberry leaves show uneven, water-soaked patches that turn brown.",
    "Blighted strawberry fruit displays shriveled, dark speckling or patches."
  ],
  "Ramularia leaf spot (caused by Ramularia grevilleana)": [
    "Strawberry leaves are dotted with small, round, white or tan spots surrounded by purple or red edges.",
    "Numerous strawberry leaf spots remain separate and do not merge together, giving a speckled look.",
    "Strawberry foliage exhibits tiny, scattered lesions with sharply defined borders.",
    "Each strawberry leaf spot often contains a bleached center, almost papery in appearance.",
    "On the strawberry leaves, spots are uniform in size and often have a purplish margin.",
    "Affected strawberry leaves may show slight yellowing around the spots.",
    "The overall appearance of the strawberry leaf remains green, but peppered with pale dots.",
    "Strawberry spots remain on both the upper and lower leaf surfaces.",
    "Some strawberry leaves display a cluster of spots along the veins."
  ],
  "Calcium deficiency": [
    "Young strawberry leaves appear deformed or curled, with distorted shapes and puckered surfaces.",
    "Strawberry leaf edges show irregular browning or dieback starting at the leaf tips.",
    "You can see small, necrotic patches on new developing strawberry leaves.",
    "The strawberry fruit displays sunken, leathery areas, often near the tip or blossom end.",
    "Strawberry plantlets exhibit stunted growth and weak stems with pale, twisted leaves.",
    "Some strawberry leaves take on a harsh, brittle texture and break easily.",
    "Rotting, brown tips appear on strawberry foliage and newly forming fruit.",
    "The youngest strawberry leaves show more severe symptoms than older leaves.",
    "In severe cases, the strawberry leaf surface is wrinkled with uneven coloration."
  ],
  "Magnesium deficiency": [
    "Strawberry leaves exhibit interveinal yellowing, with green veins standing out against a pale background.",
    "Older strawberry leaves show a distinct pattern of light yellowing between the veins.",
    "The margins of strawberry leaves become curled or slightly scorched in advanced cases.",
    "Strawberry foliage develops a mottled appearance, with patches of yellow near leaf edges.",
    "Magnesium-deficient strawberry plants maintain green centers while the surrounding areas pale.",
    "On the strawberry leaf, the tissue between veins appears faded or thin.",
    "Lower, older strawberry leaves are most visibly affected, making the plant appear uneven.",
    "Some strawberry leaves display purple or reddish tones along the leaf edges in addition to yellowing.",
    "The overall appearance is a strawberry plant with patchy, striped foliage."
  ],
  "General leaf Spot": [
    "Strawberry leaves show circular or irregular brown spots scattered across the surface.",
    "Each strawberry leaf spot is surrounded by a darker, well-defined margin.",
    "Spots on strawberry leaves may be tan or purplish, varying in size and shape.",
    "Numerous strawberry leaf spots cluster together, sometimes creating larger blotchy areas.",
    "Some strawberry spots appear slightly sunken compared to healthy tissue.",
    "Strawberry spots are more prominent on the upper surface, but may also be found underneath.",
    "Several strawberry leaves on the plant display similar spotting simultaneously.",
    "Tiny dark centers can sometimes be seen within the leaf spot on the strawberry.",
    "Affected strawberry leaves may yellow around the spots, especially in severe cases.",
    "Occasional merging of spots on a strawberry leaf leads to irregular, patchy discoloration."
  ],
  "Anthracnose": [
    "Strawberry fruit develops small, sunken, dark spots that quickly enlarge and turn black.",
    "Strawberry lesions have firm, sharply defined margins and a slightly depressed center.",
    "Some strawberry fruits display circular, water-soaked patches that later darken.",
    "On strawberry stems, elongated brown streaks or cankers may appear.",
    "In severe cases, the whole strawberry fruit becomes covered in irregular, black, sunken areas.",
    "Strawberry leaves sometimes show small brown specks or dead tissue along the veins.",
    "The blossom end of the strawberry fruit may turn dark and shriveled.",
    "Clusters of immature strawberry fruits are affected, with blackening starting at the tip.",
    "Lesions on the strawberry plant are often dry and crusty to the touch."
  ],
  "Powdery mildew": [
    "The upper surface of strawberry leaves is coated with a white or grayish powdery material.",
    "Strawberry leaves look curled or distorted, especially along the edges where the white growth is most visible.",
    "A fine, powdery layer covers young strawberry leaves and petioles.",
    "Strawberry fruits appear with uneven white patches or spots on their surface.",
    "Affected strawberry foliage develops a dull, gray appearance, hiding the natural green color.",
    "Infected strawberry leaves sometimes turn purple or reddish beneath the powdery white layer.",
    "New strawberry growth is often more heavily dusted with the white substance.",
    "Strawberry leaf undersides may also display the same powdery coating.",
    "Severely affected strawberry plants look stunted and misshapen due to twisted leaves."
  ],
  "Lack of association with strawberries": [
    "The plant shows no signs of strawberry-like leaves or fruit structures."
  ]
}